let GeoIPDB_FULL = _GetWatchlist("GEOIP");
let WindowsEvents = SecurityEvent
    | where EventID == 4625
    | order by TimeGenerated desc
    | evaluate ipv4_lookup(GeoIPDB_FULL, IpAddress, network);
WindowsEvents
| project TimeGenerated, Account, Computer, IpAddress, cityname, countryname, longitude, latitude